Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum
The result position.

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BY_COORDINATES
The position given by the coordinates X, Y and Z.

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BY_COORDINATES_MINUS
The position given by the coordinates X, Y and Z (minus side).

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BY_COORDINATES_PLUS
The position given by the coordinates X, Y and Z (plus side).

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BEAM_START_POINT
The member start position.

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BEAM_END_POINT
The member end position.

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BEAM_MID_POINT
The member middle position.

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BEAM_MID_POINT_MINUS
The member middle position (minus side).

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_BEAM_MID_POINT_PLUS
The member middle position (plus side).

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_MAX_NO_COORDINATES
No position specified, gets the maximum.

Tekla.Structures.Analysis.AnalysisResult.ResultPositionEnum.POSITION_MIN_NO_COORDINATES
No position specified, gets the minimum.